#include <stdio.h>
#include <stdlib.h>
/* run this program using the console pauser or add your own getch, system("pause") or input loop */

int main()
 {
	//20.09.2020
	system("chcp 1251");
	char sur1[9],sur2[7],sur3[10];
	char code1,code2,code3;
	float point1, point2,  point3;
	unsigned short place1, place2, place3;
	printf("Введите фамилию, код, кол-во баллов и итоговое место > ");
	scanf("%s %c %f %hu",sur1,&code1,&point1,&place1);
	printf("Введите фамилию, код, кол-во баллов и итоговое место > ");
	scanf("%s %c %f %hu",sur2,&code2,&point2,&place2);
	printf("Введите фамилию, код, кол-во баллов и итоговое место > ");
	scanf("%s %c %f %hu",sur3,&code3,&point3,&place3);
	
	printf("\n-----------------------------------------------------------------------\n");
	printf("|Ведомость спортивних состязаний                                      |\n");
	printf("|---------------------------------------------------------------------| \n");
	printf("|Фамилия участника |Код команды |Количество Баллов |Место в итоге     |\n");
	printf("|------------------|------------|------------------|------------------| \n");
	printf("|%-18s|%-12c|%-18.1f|%-18hu|\n",sur1,code1,point1,place1);
	printf("|------------------|------------|------------------|------------------|\n");
	printf("|%-18s|%-12c|%-18.2f|%-18hu|\n",sur2,code2,point2,place2);
	printf("|------------------|------------|------------------|------------------|\n");
	printf("|%-18s|%-12c|%-18.1f|%-18hu|\n",sur3,code3,point3,place3);
	printf("|---------------------------------------------------------------------|\n");
	printf("|Примечание: Д - \"Динамо\", С - \"Спартак\", Ш - \"Шахтёр\"                |\n");
	printf("-----------------------------------------------------------------------\n");
	return 0;
}
